{
  "base_model_name_or_path": "/kaggle/input/models/metric/nemotron-3-nano-30b-a3b-bf16/transformers/default/1",
  "bias": "none",
  "inference_mode": true,
  "lora_alpha": 64,
  "lora_dropout": 0.0,
  "peft_type": "LORA",
  "r": 32,
  "target_modules": [
    "in_proj",
    "out_proj",
    "q_proj",
    "k_proj",
    "v_proj",
    "o_proj"
  ],
  "task_type": "CAUSAL_LM"
}